app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-10-02 12:19:25.911793"], ["updated_at", "2018-10-02 12:19:25.911793"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 7], ["created_at", "2018-10-02 12:19:25.920890"], ["updated_at", "2018-10-02 12:19:25.920890"]]
---
  def upload
    CSV.foreach(params[:file].path, headers: true) do |file|
      Song.create(title: file[0], artist_name: file[1])